app/controllers/advertisements_controller.rb

  def index
    @advertisements = Advertisement.all
---
SELECT "advertisements".* FROM "advertisements"

  def show
@sai = Advertisement.find(params[:id])
---
SELECT "advertisements".* FROM "advertisements" WHERE "advertisements"."id" = $1 LIMIT 1  [["id", "1"]]

  def create
    @advertisement = Advertisement.new(params[:advertisement])

    respond_to do |format|
      if @advertisement.save
---
INSERT INTO "advertisements" ("created_at", "title", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", Sat, 01 Jun 2013 22:44:33 UTC +00:00], ["title", "ram bhai dosa center"], ["updated_at", Sat, 01 Jun 2013 22:44:33 UTC +00:00]]

  def destroy
    @advertisement = Advertisement.find(params[:id])
    @advertisement.destroy
---
SELECT "advertisements".* FROM "advertisements" WHERE "advertisements"."id" = $1 LIMIT 1  [["id", "1"]]
DELETE FROM "advertisements" WHERE "advertisements"."id" = $1  [["id", 1]]